## Initialisation

In [ ]:
%load_ext sql

In [ ]:
%sql mysql+mysqldb://root:root@some-mysql:3306/sakila

In [46]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

## TP2 - première partie

Il s'agit simplement de revoir les bases de SQL à l'aide d'un ensemble de requêtes sur la base de données `sakila`.

Vous pouvez ajouter des cellules de code pour explorer la base si besoin, sinon vous pouvez utiliser l'extension Database Client installée plus tôt.

In [ ]:
%sql show tables
%config SqlMagic.displaylimit = 10

### Ex 1

Récupérer l'ID, le prénom et le nom de tous les acteurs. Trier le résultat suivant le nom puis le prénom (200 tuples).

### Ex 2

Récupérer l'ID, le prénom et le nom de tous les acteurs dont le nom est 'WILLIAMS' ou 'DAVIS' (6 tuples). Y a-t-il un doublon ?

### Ex 3

Ecrire une requête portant sur la table `rental` qui retourne l'ID des clients qui ont loué un film le 25 mai 2005, de sorte qu'il n'y ait qu'une ligne par client.

Conseil :

*   utiliser l'attribut `rental_date` (quel est son type ?) et la fonction `date()` qui permet d'ignorer l'heure ;
*   le format d'une date est YYYY-MM-DD.

In [ ]:
%config SqlMagic.displaylimit = None

### Ex 4

Compléter les "blancs" (numérotés <1>, <2>…) dans la requête de façon à obtenir le résultat suivant :

| email                                 | return_date         |
|---------------------------------------|---------------------|
| DANIEL.CABRAL@sakilacustomer.org      | 2005-06-23 22:00:38 |
| TERRANCE.ROUSH@sakilacustomer.org     | 2005-06-23 21:53:46 |
| MIRIAM.MCKINNEY@sakilacustomer.org    | 2005-06-21 17:12:08 |
| GWENDOLYN.MAY@sakilacustomer.org      | 2005-06-20 02:40:27 |
| JEANETTE.GREENE@sakilacustomer.org    | 2005-06-19 23:26:46 |
| HERMAN.DEVORE@sakilacustomer.org      | 2005-06-19 03:20:09 |
| JEFFERY.PINSON@sakilacustomer.org     | 2005-06-18 21:37:33 |
| MATTHEW.MAHAN@sakilacustomer.org      | 2005-06-18 05:18:58 |
| MINNIE.ROMERO@sakilacustomer.org      | 2005-06-18 01:58:34 |
| SONIA.GREGORY@sakilacustomer.org      | 2005-06-17 21:44:11 |
| TERRENCE.GUNDERSON@sakilacustomer.org | 2005-06-17 05:28:35 |
| ELMER.NOE@sakilacustomer.org          | 2005-06-17 02:11:13 |
| JOYCE.EDWARDS@sakilacustomer.org      | 2005-06-16 21:00:26 |
| AMBER.DIXON@sakilacustomer.org        | 2005-06-16 04:02:56 |
| CHARLES.KOWALSKI@sakilacustomer.org   | 2005-06-16 02:26:34 |
| CATHERINE.CAMPBELL@sakilacustomer.org | 2005-06-15 20:43:03 |

Conseil :

*   voir clause `ORDER BY` ;
*   lors de la création d'un alias, le mot-clé `AS` est optionnel (`customer AS c` ou `customer c`).

In [ ]:
%%sql # ex 4

SELECT c.email, r.return_date
FROM customer c
  INNER JOIN rental <1>
  ON c.customer_id = <2>
WHERE date(r.rental_date) = '2005-06-14'
ORDER BY <3> <4>;

### Ex 5

Compléter les "blancs" (numérotés <1>, <2>…) dans la requête de façon à obtenir le résultat suivant :

| first_name | last_name | address                | city           |
|------------|-----------|------------------------|----------------|
| PATRICIA   | JOHNSON   | 1121 Loja Avenue       | San Bernardino |
| BETTY      | WHITE     | 770 Bydgoszcz Avenue   | Citrus Heights |
| ALICE      | STEWART   | 1135 Izumisano Parkway | Fontana        |
| ROSA       | REYNOLDS  | 793 Cam Ranh Avenue    | Lancaster      |
| RENEE      | LANE      | 533 al-Ayn Boulevard   | Compton        |
| KRISTIN    | JOHNSTON  | 226 Brest Manor        | Sunnyvale      |
| CASSANDRA  | WALTERS   | 920 Kumbakonam Loop    | Salinas        |
| JACOB      | LANCE     | 1866 al-Qatif Avenue   | El Monte       |
| RENE       | MCALISTER | 1895 Zhezqazghan Drive | Garden Grove   |

In [ ]:
%%sql # ex5

SELECT c.first_name, c.last_name, a.address, ct.city
FROM customer c
  INNER JOIN address <1>
  ON c.address_id = a.address_id
  INNER JOIN city ct
  ON a.city_id = <2>
WHERE a.district = 'California';

Ecrire la même requête sans le join

### Ex 6

Ecrire une requête qui retourne le titre de tous les films dans lequel joue un acteur prénommé 'JOHN' (29 tuples).

La même requête sans les JOIN ?

### Ex 7

Ecrire une requête qui retourne les couples d'adresses distinctes (précisément les rues et numéros de rue) qui sont dans la même ville (4 tuples).

Conseil : utiliser une jointure de la table des adresses avec elle même pour retourner des doublets d'adresses dans la même ville.

### Ex 8

Ecrire une requête qui compte le nombre de tuples dans la table `payment` (16 044).

Conseil : utiliser la fonction `count`

Modifier la requête précédente afin de compter le nombre de paiements effectués par chaque client et y associer l'ID du client et le total de ses paiements.

| customer_id | nb_payment | total_payment |
|-------------|------------|---------------|
| 1           | 32         | 118.68        |
| 2           | 27         | 128.73        |
| 3           | 26         | 135.74        |
| 4           | 22         | 81.78         |
| 5           | 38         | 144.62        |
| ...         | ...        | ...           |
| 595         | 30         | 117.70        |
| 596         | 28         | 96.72         |
| 597         | 25         | 99.75         |
| 598         | 22         | 83.78         |
| 599         | 19         | 83.81         |

Conseil : utiliser la fonction `sum` et la clause `GROUP BY`.

Modifier la requête précédente afin de n'inclure que les clients qui ont fait au moins 40 paiements.

| customer_id | nb_payment | total_payment |
|-------------|------------|---------------|
| 75          | 41         | 155.59        |
| 144         | 42         | 195.58        |
| 148         | 46         | 216.54        |
| 197         | 40         | 154.60        |
| 236         | 42         | 175.58        |
| 469         | 40         | 177.60        |
| 526         | 45         | 221.55        |

Conseil : voir clause `HAVING`.

### Ex 9

Ecrire une requête qui retourne les titres des films d'action `category.name = 'Action'` (64 tuples de 'AMADEUS HOLY' à 'WORST BANGER').

Faites cette requête de 3 façons :

* avec des jointures 
* en filtrant la relation `film` à l'aide d'une sous-requête qui retourne l'ID de tous les films d'action
* sans jointure et sans filtre

## TP2 - partie optionnelle

### 1. Définition d'une fenêtre d'analyse

#### 1.1 Définition via une fonction d'agrégation

Soit la requête suivante sur la base de données sakila, qui donne les ventes mensuelles de mai à août 2005 (la fonction `quarter` retourne le trimestre associé à une date et la fonction `monthname` le mois).

In [89]:
%%sql 
SELECT quarter(payment_date) quarter,
  monthname(payment_date) month_nm,
  sum(amount) monthly_sales
FROM payment
WHERE year(payment_date) = 2005
GROUP BY quarter(payment_date), monthname(payment_date);

Pour comparer ces chiffres avec les meilleures ventes mensuelles et les meilleures ventes du trimestre on a besoin de créer des **fenêtres** qui vont regrouper des lignes sur des critères temporels (mais le principe peut s'appliquer à d'autres types de valeur) et y associer de nouvelles colonnes, ce qu'on va pouvoir faire en associant des **clauses** aux fonctions d'agrégation.

Une fenêtre est créée à l'aide d'une clause `over` combinée avec des clauses optionnelles en paramètre. L'absence de clauses optionnelles indique que toutes les données sont prises en compte.

In [90]:
%%sql 
SELECT quarter(payment_date) quarter,
  monthname(payment_date) month_nm,
  sum(amount) monthly_sales,
  max(sum(amount))
    over () max_overall_sales,
  max(sum(amount))
    over (partition by quarter(payment_date)) max_qrtr_sales
FROM payment
WHERE year(payment_date) = 2005
GROUP BY quarter(payment_date), monthname(payment_date);

Quelles peuvent être ces clauses optionnelles :

- `partition by` définit une fenêtre par valeur de l'expression passée en paramètre ;
- `order by` ordonne les tuples de la fenêtre suivant l'expression passée en paramètre (avec la possibilité d'un ordre ascendant ou descendant avec les mots-clefs `ASC` et `DESC`) ;
- `rows` définit la fenêtre en fonction du tuple courant, par exemple, `rows between 1 preceding and 1 following` sélectionne une fenêtre de 3 tuples centrée sur le tuple courant ; `rows  unbounded preceding` sélectionne tous les tuples précédents, tuple courant inclus ;
- `range` définit la fenêtre suivant un domaine de valeurs, par exemple, `range between interval 3 day preceding and interval 3 day  following` définit une fenêtre de 7 jours autour d'une date qui apparaîtrait dans une clause `order by`.

#### 1.2 Définition via des fonctions autres

##### 1.2.1 Classement

La fonction `rank` associe un classement au tuple courant en fonction de la fenêtre qui lui est associée.

In [91]:
%%sql 
SELECT quarter(payment_date) quarter,
  monthname(payment_date) month_nm,
  sum(amount) monthly_sales,
  rank() over (order by sum(amount) desc) sales_rank
FROM payment
WHERE year(payment_date) = 2005
GROUP BY quarter(payment_date), monthname(payment_date)
ORDER BY quarter, month_nm;

La quatrième colonne `sales_rank` donne ainsi le classement des ventes mensuelles. Il est par exemple possible de raffiner le classement par rapport à une fenêtre de temps, par exemple trimestrielle, en ajoutant une clause `partition by`.

In [92]:
%%sql 
SELECT quarter(payment_date) quart,
  monthname(payment_date) month_nm,
  sum(amount) monthly_sales,
    rank() over (
      partition by quarter(payment_date)
      order by sum(amount) desc
    ) qtr_sales_rank
FROM payment
WHERE year(payment_date) = 2005
GROUP BY quarter(payment_date), monthname(payment_date)
ORDER BY quart, month_nm;

**Gestion des égalités**

Il y a différentes manières de traiter les égalités, comme le montre la requête suivante (la fonction `dense_rank` évite les trous dans le classement) :

In [93]:
%%sql 
SELECT customer_id, count(*) num_rentals,
  row_number() over (order by count(*) desc) row_number_rnk,
  rank() over (order by count(*) desc) rank_rnk,
  dense_rank() over (order by count(*) desc) dense_rank_rnk
FROM rental
GROUP BY customer_id
ORDER BY num_rentals DESC;

##### 1.2.2 Comparaison d'une valeur avec les valeurs suivantes ou précédentes

Ce type de comparaison s'effectue avec les fonctions `lag` (qui définie une fenêtre sur les valeurs précédentes) et `lead` (qui définie une fenêtre sur les valeurs suivantes). Le premier paramètre donne la valeur à comparer et le deuxième (par défaut 1) la taille de la fenêtre.

Par exemple

In [94]:
%%sql
 
SELECT yearweek(payment_date) payment_week,
  sum(amount) week_total,
  lag(sum(amount), 1)
     over (order by yearweek(payment_date)) prev_wk_tot,
  lead(sum(amount), 1)
     over (order by yearweek(payment_date)) next_wk_tot
FROM payment
GROUP BY yearweek(payment_date)
ORDER BY payment_week;

#### 1.3 Pour en savoir plus

Voir [https://dev.mysql.com/doc/refman/8.0/en/window-functions.html](https://dev.mysql.com/doc/refman/8.0/en/window-functions.html).

### Ex 1

Créer la table `sales_fact` avec

|   year_no  | month_no |  tot_sales  |
|------|----|-------|
| 2019 | 1  | 19228 |
| 2019 | 2  | 18554 |
| 2019 | 3  | 17325 |
| 2019 | 4  | 13221 |
| 2019 | 5  | 9964  |
| 2019 | 6  | 12658 |
| 2019 | 7  | 14233 |
| 2019 | 8  | 17342 |
| 2019 | 9  | 16853 |
| 2019 | 10 | 17121 |
| 2019 | 11 | 19095 |
| 2019 | 12 | 21436 |
| 2020 | 1  | 20347 |
| 2020 | 2  | 17434 |
| 2020 | 3  | 16225 |
| 2020 | 4  | 13853 |
| 2020 | 5  | 14589 |
| 2020 | 6  | 13248 |
| 2020 | 7  | 8728  |
| 2020 | 8  | 9378  |
| 2020 | 9  | 11467 |
| 2020 | 10 | 13842 |
| 2020 | 11 | 15742 |
| 2020 | 12 | 18636 |

In [ ]:
%%sql # creation table
CREATE TABLE sales_fact (
    ...
    PRIMARY KEY(...)
);

In [ ]:
%%sql
INSERT INTO ... VALUES ...;

Vérifier que le total des ventes est 370 519.

### Ex 2

Ecrire une requête qui ajoute une colonne qui classe les ventes sur toute la période ( 1 pour le meilleur classement et 24 pour le moins bon).

Modifier la requête pour que la dernière colonne calcule des classements par année.

### Ex 3

Ecrire une requête qui sélectionne les résultats de 2020 et ajoute une colonne qui pour chaque mois contient les résultats du mois précédent.

### Ex 5

JupySQL permet une intégration avec la célèbre bibliothèque Pandas. Pandas est une bibliothèque Python puissante et flexible utilisée pour la manipulation et l'analyse de données, offrant des structures comme les DataFrames pour gérer facilement des ensembles de données tabulaires.
Seaborn est une bibliothèque de visualisation de données basée sur Matplotlib, permettant de créer des graphiques statistiques facilement et avec des thèmes esthétiques intégrés pour l'analyse de données. Nous allons utiliser ces bibliothèque pour afficher des résultats.

Consultez la documentation de JupySQL et Seaborn et affichez une courbe présentant les résultats par jour, en groupant par catégorie de film.

Conseil : 

* utilisez la fonction seaborn `relplot`, vous pouvez utiliser les paramètres `hue`, `row` ou `col` pour regarder les détails par catégorie.

In [95]:
%%sql result << # ex 4
SELECT ...

In [96]:
import pandas as pd 
df = pd.DataFrame(result)

In [97]:
import seaborn as sns
sns.relplot(...)

### Ex 6

On voit des chutes de ventes sur certains jours. Lesquels sont-ils ? Préparer une requête employant la fonction `rank` pour les découvrir.

In [ ]:
%%sql 
SELECT ...;

In [ ]:
import seaborn as sns
sns.relplot(...)